## Plan Result (prod_global)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https_www_redirect[&#34;et-pet&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                   = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod"
        name                                 = "hmcts-prod"
        tags                                 = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (11 unchanged attributes hidden)

      + frontend_endpoint {
          + host_name                    = "www.employmenttribunals.service.gov.uk"
          + name                         = "wwwet-pet"
          + session_affinity_enabled     = false
          + session_affinity_ttl_seconds = 0
        }

      ~ routing_rule {
          ~ frontend_endpoints = [
              - "response",
              + "wwwet-pet",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/responseredirect"
          ~ name               = "responseredirect" -> "et-petwwwRedirect"
            # (3 unchanged attributes hidden)

          ~ redirect_configuration {
              ~ custom_host       = "incidents.hmcts.net" -> "employmenttribunals.service.gov.uk"
                # (2 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sandbox-build",
              + "response",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/sandbox-buildredirect"
          ~ name               = "sandbox-buildredirect" -> "responseredirect"
            # (3 unchanged attributes hidden)

          ~ redirect_configuration {
              ~ custom_host       = "sandbox-build.hmcts.net" -> "incidents.hmcts.net"
                # (2 unchanged attributes hidden)
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "sandbox-build",
            ]
          + name               = "sandbox-buildredirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "sandbox-build.hmcts.net"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (298 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https_www_redirect["et-pet"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https_www_redirect" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/wwwet-pet"
      + id                                = (known after apply)

      + custom_https_configuration {
          + azure_key_vault_certificate_secret_name = "employmenttribunals-service-gov-uk"
          + azure_key_vault_certificate_vault_id    = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappsprod"
          + certificate_source                      = "AzureKeyVault"
          + minimum_tls_version                     = (known after apply)
          + provisioning_state                      = (known after apply)
          + provisioning_substate                   = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1731,"Program":"tfcmt","SHA1":"","Target":"prod_global","Vars":{}} -->